Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: ཁ་ཅིག་འདི་སྙམ་དུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་དོན་དམ་པར་ཕུང་པོ་ལ་སོགས་པའི་ངོ་བོ་ཉིད་མེད་དུ་ཟིན་ཀྱང་། ཀུན་རྫོབ་ཀྱི་སྒོ་ནས་ཕུང་པོ་ལ་སོགས་པར་བཏགས་པའི་ངོ་བོ་ཉིད་དུ་ཡོད་དོ་སྙམ་དུ་སེམས་ཏེ།
en: where the Lord has also taught as though a bodhisattva existed, some think that even if, ultimately, bodhisattvas are taken to lack an intrinsic nature of the aggregates and so on, still, they do exist from a conventional perspective as having what has been labeled onto the aggregates and so on as their intrinsic nature.

source: དེའི་ཕྱིར་བཏགས་པ་དེ་ཡང་ཡོད་པ་མ་ཡིན་པར་བསྟན་ཏེ། དེའི་འོག་ཏུ་ཚིག་{བླ་དགས་,བླ་དྭགས་}མི་དམིགས་པའི་གདམས་པ་བསྟན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱིས་ཞུས་པའི་ཚིག་དེ་ཉིད་བཟུང་སྟེ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་འདི་གཟུགས་ཀྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}ཡིན་སྙམ་མམ།
en: Therefore, to teach that even that designation does not exist, after that, taking the words of the question as his point of departure to teach the instructions by not apprehending words for things, the Lord asks, “What do you think, Subhūti, is bodhisattva the word for form?

source: ཅི་བྱང་ཆུབ་སེམས་དཔའ་འདི་ཚོར་བའི་ཚིག་{བླ་དགས་,བླ་དྭགས་}ཡིན་སྙམ་མམ་ཞེས་བྱ་བ་ལ་སོགས་པ་དྲིས་སོ། །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཚིག་{བླ་དགས་,བླ་དྭགས་}ཀྱི་ངོ་བོ་ཉིད་ཡིན་ན།
en: Or do you think bodhisattva is the word for feeling?”

source: གཟུགས་ལ་སོགས་པ་ལྔ་དང་།
en: and so on.

source: དེ་དག་རྟག་པ་དང་མི་རྟག་པ་ལ་སོགས་པ་བཅུ་བཞིའི་ཚིག་{བླ་དགས་,བླ་དྭགས་}རྣམས་ཀྱི་ངོ་བོ་ཉིད་དུ་འགྱུར་ཏེ་དེའི་ཕྱིར།
en: Were a word for something to be the bodhisattvas’ intrinsic nature then the words for the five—form and so on—and the fourteen—permanent and impermanent and so on—would become their intrinsic nature.

source: ཅི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་གཟུགས་ཀྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}ཡིན་སྙམ་མམ།
en: Therefore it asks, having taken the word for each of them separately, “Do you think bodhisattva is the word for form?

source: ཅི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་ཚོར་བའི་ཚིག་{བླ་དགས་,བླ་དྭགས་}ཡིན་སྙམ་མམ་ཞེས་སོ་སོའི་ཚིག་{བླ་དགས་,བླ་དྭགས་}རྣམས་བཟུང་སྟེ་དྲིས་སོ།
en: Do you think bodhisattva is the word for feeling?”

source: །དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་གཟུགས་ལ་སོགས་པ་ཀུན་བརྟགས་པ་ཡིན་པའི་ཕྱིར་ཤིན་ཏུ་མེད་པ་ཉིད་ཡིན་ན་དེ་དག་གི་ཚིག་{བླ་དགས་,བླ་དྭགས་}དམིགས་པར་ལྟ་ག་ལ་འགྱུར།
en: Then, given that form and so on are absolutely nonexistent because they are imaginary phenomena, how could words for them be apprehended?

source: ཚིག་{བླ་དགས་,བླ་དྭགས་}མི་དམིགས་ན་བྱང་ཆུབ་སེམས་དཔའ་ལྟ་ག་ལ་འགྱུར་ཞེས་ཚིག་བླ་དགས་མེད་པ་དང་།
en: If words for things are not apprehended, how could there be a bodhisattva?

source: བྱང་ཆུབ་སེམས་དཔའ་ཚིག་{བླ་དགས་,བླ་དྭགས་}ཀྱི་ངོ་བོ་ཉིད་མེད་པར་བསྟན་ཏོ།
en: Thus, the elder Subhūti teaches that words for things do not exist, and bodhisattvas do not exist with the words for them as their intrinsic nature.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིག་{བླ་དགས་,བླ་དྭགས་}རྣམས་མི་དམིགས་པ་ཉིད་ལ་བརྟེན་ནས་རབ་འབྱོར་ལེགས་སོ་ལེགས་སོ།
en: Then, based on the fact that they do not apprehend words for things, “Excellent, excellent, Subhūti!” said the Lord. “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་གཟུགས་ཀྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}མི་དམིགས་པ་ཞེས་བྱ་བ་ནས་རྣམ་པར་ཤེས་པ་བདེ་བ་དང་། སྡུག་བསྔལ་བ་དང་། བདག་ཡོད་པ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། མ་ཞི་བ་དང་། སྟོང་པ་དང་། མི་སྟོང་པ་དང་། མཚན་མ་ཡོད་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་ཡོད་པ་དང་། སྨོན་པ་མེད་པའི་ཚིག་{བླ་དགས་,བླ་དྭགས་}མི་དམིགས་པར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ་ཞེས་བྱ་བའི་བར་གྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}རྣམས་ཀྱིས་གདམས་སོ། །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དོན་དམ་པ་དང་། ཀུན་རྫོབ་ཏུ་ཡང་མེད་པར་བསྟན་ནས།
en: Bodhisattva great beings practicing the perfection of wisdom like that, Subhūti, should train in the perfection of wisdom without apprehending a word for form,” up to without apprehending the words for… consciousness is… a pleasurable state, a suffering state, self, selflessness, calmness, noncalmness, emptiness, nonemptiness, the state of having a sign, signlessness, the state of being wished for, or wishlessness,” is the instruction by words for things.

source: བྱང་ཆུབ་སེམས་དཔའ་འབའ་ཞིག་མེད་པར་མ་ཟད་ཀྱི། ཆོས་ཐམས་ཅད་ཀྱང་མེད་དོ་ཞེས་ཆོས་ཐམས་ཅད་མི་དམིགས་པའི་གདམས་པ་བསྟན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱིས་གནས་བརྟན་རབ་འབྱོར་གྱིས་སྔར་ཞུས་པའི་ཚིག་བཟུང་ནས། རབ་འབྱོར་གང་ཡང་ཁྱོད་འདི་སྐད་དུ་ཞེས་བྱ་བས་སྐབས་ཕྱིའོ། །གནས་བརྟན་རབ་འབྱོར་གྱིས་སྔར་བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བའི་ཆོས་བདག་གིས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞེས།
en: Instructions for making an effort when all dharmas cannot be apprehended Having thus taught that a “bodhisattva” does not ultimately, or even conventionally, exist, then, in order to teach the instructions when all dharmas cannot be apprehended, that not only does a bodhisattva not exist, but all dharmas do not exist either, the Lord sets the scene by taking the words of the elder Subhūti’s earlier question: “Again, Subhūti, you say…” Earlier, the elder Subhūti, with, “I do not see that—namely, the phenomenon bodhisattva,” has said he does not see a phenomenon called “bodhisattva,” teaching that nobody, ultimately, sees anything at all.

source: བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བའི་ཆོས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ངོ་ཞེས་སྨྲས་པས་དོན་དམ་པར་སུས་ཀྱང་ཅི་འང་མ་མཐོང་ངོ་ཞེས་བསྟན་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དོན་དམ་པར་ཡོངས་སུ་མ་གྲུབ་པའི་གནས་སྐབས་ན་སུས་ཀྱང་ཅི་ཡང་མ་མཐོང་ལ་དེ་ཡང་གཞན་གྱིས་མི་མཐོང་ངོ་ཞེས་བསྟན་པའི་ཕྱིར། རབ་འབྱོར་ཆོས་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཆོས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: Then, the Lord again, in order to teach that ultimately, during the non-thoroughly established period when nobody sees anything at all and nothing else sees that either, says, “Subhūti, the dharma does not see the dharma-constituent; the dharma-constituent does not see the dharma,” and so on.

source: །ཀུན་བརྟགས་པའི་ཆོས་ཀྱིས་ཡོངས་སུ་གྲུབ་པའི་ཆོས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ལ། ཡོངས་སུ་གྲུབ་པའི་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀྱང་། ཀུན་བརྟགས་པའི་ཆོས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་སྟེ།
en: The idea is that a falsely imagined dharma does not see a thoroughly established dharma-constituent, and a thoroughly established dharma-constituent does not see a falsely imagined dharma either.

source: དེ་ཉིད་བསྟན་པའི་ཕྱིར་གཟུགས་ཀྱི་ཁམས་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: To teach just that it says, “Subhūti, the form constituent does not see the dharma-constituent,” and so on.

source: །དེ་ནས་ཡང་ཐ་དད་པ་དེའི་གཏན་ཚིགས་སུ་དེ་ཅིའི་ཕྱིར་ཞེ་ན་འདུས་བྱས་མ་གཏོགས་པར་འདུས་མ་བྱས་གདགས་པར་མི་ནུས་སོ་ཞེས་གསུངས་སོ།
en: Then, when they are different, as the reason for that, it also says, “And why? You cannot make the uncompounded known without the compounded, and you cannot make the compounded known without the uncompounded.”

source: །གལ་ཏེ་འདུས་བྱས་ཀྱི་ཆོས་དང་འདུས་མ་བྱས་པའི་ཆོས་ཐ་དད་པར་གྱུར་ན། དེ་ལྟ་ན་ནི་གཅིག་གིས་གཅིག་མཐོང་བར་ཡང་འགྱུར་བ་ཞིག་ན། འདུས་བྱས་རྣམས་ལ་འདུས་མ་བྱས་ཞེས་བྱ་བ་ཐ་དད་པ་ཅི་ཡང་མེད་དོ།
en: If compounded dharmas and uncompounded dharmas were to be different, in that case one might be seen by the other, but there are no separate “uncompounded phenomena” at all for compounded phenomena.

source: །དེ་ཡང་འདི་ལྟར་དེ་བཞིན་ཉིད་དེ་ཉིད་མ་དག་པའི་གནས་སྐབས་ན་ནི་འདུས་བྱས་ཞེས་བྱ་ལ། དེ་ཉིད་དག་པའི་གནས་སྐབས་ན་ནི་འདུས་མ་བྱས་ཞེས་བྱའོ།
en: So, it is just suchness itself called “a compounded phenomenon” during the impure period, and just that itself called “an uncompounded phenomenon” during the purified period.

source: །དཔེར་ན་ཆུ་སྔར་མ་དངས་པ་ལས་ཕྱིས་རབ་ཏུ་དངས་པར་གྱུར་པ་ལ་ཡང་ཆུ་དེ་ཉིད་ཅེས་བྱ་བ་དང་། ཇི་ལྟར་ནམ་མཁའ་སྤྲིན་ལ་སོགས་པས་དྲི་མ་ཅན་དུ་གྱུར་པ་ལ་ཕྱིས་དྲི་མ་མེད་པར་གྱུར་པ་ལ་ཡང་། ནམ་མཁའ་དེ་ཉིད་ཅེས་བྱ་བ་དེ་བཞིན་དུ།
en: This is just like previously murky water that has later become clear—it is just that water itself—and like the sky earlier spotted with clouds and so on that has later become spotless—it is just that sky itself.

source: སྔར་མ་དག་པའི་དེ་བཞིན་ཉིད་ཕྱིས་ཤིན་ཏུ་རྣམ་པར་དག་པར་གྱུར་པ་ན་ཡང་དེ་ཉིད་དེ་བཞིན་ཉིད་ཡིན་པས་འདུས་བྱས་ཀྱི་ཆོས་རྣམས་དང་། འདུས་མ་བྱས་པ་རྣམས་ལ་ངོ་བོ་ཉིད་ཐ་དད་པ་མེད་དོ།
en: Similarly, with previously impure suchness—when it has become totally purified it is still just that suchness, so compounded dharmas and uncompounded dharmas do not have different intrinsic natures.

source: །དེ་བས་ན་ཇི་ལྟར་བདག་ཉིད་ཀྱིས་བདག་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་དེ་བཞིན་དུ་ཀུན་བརྟགས་པའི་ཆོས་ཀྱིས་ཡོངས་སུ་གྲུབ་པའི་ཆོས་ཀྱི་དབྱིངས་མི་མཐོང་ལ། ཡོངས་སུ་གྲུབ་པའི་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀྱང་ཀུན་བརྟགས་པའི་ཆོས་མི་མཐོང་ངོ་ཞེས་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན་གཞན་གྱིས་ནི་གཞན་མཐོང་བར་འགྱུར་གྱི་བདག་ཉིད་ཀྱིས་ནི་བདག་ཉིད་མི་མཐོང་ངོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Therefore, just as a self does not itself see itself, so too a falsely imagined dharma does not see a thoroughly established dharma-constituent, and a thoroughly established dharma-constituent does not see a falsely imagined dharma either.

source: །ཆོས་ཐམས་ཅད་མི་དམིགས་པར་སྦྱོར་བ་འདིའི་ཕན་ཡོན་བསྟན་པའི་ཕྱིར།
en: That is what it means.

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་གང་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བས། མི་སྐྲག །མི་དངང་།
en: To teach the benefit of this practice when all dharmas cannot be apprehended it says, “Subhūti, bodhisattva great beings practicing the perfection of wisdom like that do not see any dharma at all, but they do not tremble, feel frightened, or become terrified at not seeing; their minds are not cowed by any dharma, do not tense up, and do not experience regret.”

source: དངང་བར་མི་འགྱུར་ཞིང་། དེའི་སེམས་ཞུམ་པར་མི་འགྱུར། ཀུན་ཏུ་ཞུམ་པར་མི་འགྱུར། ཡིད་ལ་འགྱོད་པ་སྐྱེ་བར་མི་འགྱུར་རོ་ཞེས་བྱ་བ་གསུངས་སོ། །ཆོས་ཐམས་ཅད་མི་དམིགས་པར་སྦྱོར་བ་འདིའི་འབྲས་བུ་ཡང་དད་པ་མངོན་པར་འཕེལ་བ་དང་།
en: The result of this practice when all dharmas cannot be apprehended is also an increase in faith and an increase in wisdom.

source: ཤེས་རབ་མངོན་པར་འཕེལ་བ་སྟེ། དད་པ་མངོན་པར་འཕེལ་བ་ནི་སྐྲག་པ་ལ་སོགས་པ་མེད་དོ། །ཤེས་རབ་མངོན་པར་འཕེལ་བ་ནི་སེམས་འགོང་བ་དང་། འབྱིང་བ་མེད་དོ།
en: With an increase in faith “they do not tremble” and so on; with an increase in wisdom their minds do not sink down and become disenchanted.

source: །དད་པ་དེ་ཡང་གནས་གསུམ་ལ་ལྷག་པར་འགྱུར་ཏེ། ཆོས་ཟབ་མོ་བཤད་པ་དང་། ཤིན་ཏུ་བྱ་དཀའ་བ་བསྒྲུབ་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཤིན་ཏུ་ངོ་མཚར་རྨད་དུ་བྱུང་བ་རྣམས་ལ་བྱ་སྟེ།
en: That faith, furthermore, is especially for three objects: it is felt for the explanations of the deep doctrine, the achievement of what is extremely difficult to do, and the totally amazing, marvelous buddhadharmas.

source: གནས་དེ་གསུམ་ལ་དད་པ་མངོན་པར་འཕེལ་ན་དེ་ལ་མ་དད་པ་ལས་བྱུང་བའི་སྐྲག་པ་སྐྱེ་བར་མི་འགྱུར་ཞིང་། ཟབ་མོའི་གནས་གསུམ་པོ་དེ་དག་ཉིད་ལ་མི་ཤེས་པ་ལས་བྱུང་བའི་སེམས་ཞུམ་པ་སྐྱེ་བར་མི་འགྱུར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means that when faith in those three objects increases, the trembling and so on that arise from an absence of faith do not occur, and the cowed mind that arises from the absence of knowledge of just those three profound objects does not occur.

source: །དེ་ལ་དང་པོ་འབྱུང་བའི་ཚེ་ཆུང་ངུའི་གནས་སྐབས་ལ་ནི་སྐྲག་པ་ཞེས་བྱའོ། །བར་གྱི་གནས་སྐབས་ལ་ནི་དངང་བ་ཞེས་བྱའོ། །ཆེན་པོར་གྱུར་པའི་གནས་སྐབས་ལ་ནི་དངང་བར་འགྱུར་བ་ཞེས་བྱའོ།
en: There they are said to “tremble” when it is slight, when it first happens; said to “feel frightened” when it is middling; and said to “become terrified” when it is huge.

source: །དེ་བཞིན་དུ་སེམས་འགོང་བ་ལ་ཡང་གནས་སྐབས་གསུམ་དུ་སྦྱར་བར་བྱའོ།
en: Connect the feeling of disenchantment with the three time periods like that as well.

source: །དེ་ནས་གཟུགས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ཆོས་ཐམས་ཅད་མི་དམིགས་པ་དེ་ཉིད་རྒྱས་པར་བསྟན་ཏོ། །ཕུང་པོ་དང་། ཁམས་དང་།
en: Then, they “do not see form” and so on is a detailed teaching of just that—of dharmas that cannot be apprehended.

source: སྐྱེ་མཆེད་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ཡན་ལག་རྣམས་དང་། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་རྣམས་དང་། བདག་དང་། སེམས་ཅན་དང་། སྲོག་ལ་སོགས་པ་བཅུ་གསུམ་དང་། འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་དང་། ཉན་ཐོས་དང་། ཉན་ཐོས་ཀྱི་ཆོས་རྣམས་དང་། རང་སངས་རྒྱས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་དང་།སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། བྱང་ཆུབ་ཅེས་བྱ་བ་སྟེ། ཆོས་དེ་དག་ཐམས་ཅད་བསྟན་ཏོ། །ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ཡན་ལག་རྣམས་ཀྱིས་ནི་ཕྱི་དང་ནང་གི་ཆོས་ཐམས་ཅད་བསྡུས་སོ། །འདོད་ཆགས་དང་།
en: It teaches all the dharmas: the aggregates, constituents, sense fields, links of dependent origination, “greed, hatred, and confusion;” the thirteen— “a self, a being, and a living being,” and so on; “the desire realm, form realm, and formless realm;” and “śrāvakas and śrāvakadharmas… pratyekabuddhas and pratyekabuddhadharmas… bodhisattvas and bodhisattva dharmas … buddhas and buddhadharmas… and awakening.”

source: ཞེ་སྡང་དང་། གཏི་མུག་རྣམས་ཀྱིས་ནི་ཉོན་མོངས་པ་དང་། གནས་ངན་ལེན་གྱི་ཕྱོགས་ཐམས་ཅད་བསྡུས་སོ། །བདག་དང་སེམས་ཅན་ལ་སོགས་པས་ནི་ཤིན་ཏུ་མེད་ཅིང་བཏགས་པའི་ཆོས་རྣམས་བསྡུས་སོ། །ཁམས་གསུམ་གྱིས་ནི་འཁོར་བའི་ཆོས་ཐམས་ཅད་བསྡུས་སོ། །ཉན་ཐོས་ལ་སོགས་པས་ནི་རྣམ་པར་བྱང་བ་དཀར་པོའི་ཆོས་ཐམས་ཅད་བསྡུས་སོ།
en: The aggregates, constituents, sense fields, and links of dependent origination incorporate all inner and outer dharmas; “greed, hatred, and confusion” incorporate all on the side of defilement and the basis of suffering; “a self, a being,” and so on incorporate the totally nonexistent designation dharmas; the three realms incorporate all the dharmas in the cycles of existence; and “śrāvakas” and so on incorporate all bright purification dharmas. “

source: །སེམས་དང་སེམས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱ་བ་དེས་ནི་འཇུག་པའི་རྣམ་པར་ཤེས་པ་དྲུག་དང་། ཀུན་གཞི་རྣམ་པར་ཤེས་པ་དང་། དེ་དང་མཚུངས་པར་ལྡན་པ་རྣམས་བསྟན་ཏོ། །ཡིད་དང་ཡིད་ཀྱི་ཆོས་རྣམས་ཞེས་བྱ་བ་དེས་ནི་ཉོན་མོངས་པའི་ཡིད་དང་། དེ་དང་མཚུངས་པར་ལྡན་པ་རྣམས་བསྟན་ཏོ།
en: Mind and mental factor dharmas” incorporate the six engaging consciousnesses and the foundation consciousness, and what are associated with them, and “thinking mind and thinking mind dharmas” teach the afflicted thinking mind and what is associated with it.

source: །དེ་ལྟར་བརྩོན་པའི་གདམས་པ་ལྔ་པ་སྟེ་རྫོགས་པར་བྱས་ནས་དེའི་འོག་ཏུ་བརྩོན་པའི་ཡོན་ཏན་ཞེས་བྱ་བ་དྲུག་པ་བསྟན་པའི་ཕྱིར། བཅོམ་ལྡན་འདས་གཟུགས་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནས། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལས་གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། སངས་རྒྱས་ཀྱི་ས་ལ་བསླབ་པར་བྱ་བའི་ཐེག་པ་གསུམ་པོ་དག་རྒྱ་ཆེར་བསྟན་ཏོ་ཞེས་བྱ་བའི་གཞུང་གི་ཚིག་མང་པོས་བསྟན་ཏོ།
en: Benefits of the endeavor Having thus completed the fifth, the instructions for the endeavor, to teach the sixth, the benefits of the endeavor, it gives an exposition in a long passage of the text, from, “Lord, bodhisattva great beings who want to comprehend form should train in the perfection of wisdom,” and so on, up to “because in this perfection of wisdom there is detailed instruction for the three vehicles in which bodhisattva great beings should train on the level of śrāvakas and pratyekabuddhas, bodhisattvas, and buddhas.”

source: །འདི་ལ་ཡང་ཕན་ཡོན་རྣམ་པ་བཞི་སྟེ། ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཆོས་རྣམས་ཡོངས་སུ་ཤེས་པ་དང་། སྤང་བར་བྱ་བ་རྣམས་སྤངས་པ་དང་། ཡོངས་སུ་རྫོགས་པར་བྱ་བ་རྣམས་བསྒོམས་པས་ཡོངས་སུ་རྫོགས་པ་དང་། མངོན་སུམ་དུ་བྱ་བ་རྣམས་ཐོབ་པས་མངོན་སུམ་དུ་བྱས་པའོ།
en: Again, here there are four benefits: comprehension of the dharmas that have to be comprehended;elimination of those that have to be eliminated;perfecting in meditation those that have to be perfected; anddirect witness by reaching those that have to be directly witnessed.

source: །དེ་ལ་བཅོམ་ལྡན་འདས་གཟུགས་ཡོངས་སུ་རྟོགས་པར་འཚལ་བས་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་ཡོངས་སུ་ཤེས་པའི་ཕན་ཡོན་བསྟན་ཏེ། ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ཡན་ལག་རྣམས་ཡོངས་སུ་ཤེས་པར་བྱའོ་ཞེས་འབྱུང་བའི་ཕྱིར་རོ། །འདོད་ཆགས་དང་། ཞེ་སྡང་དང་།
en: Among these, “Lord, bodhisattva great beings who want to comprehend form,” and so on, teaches the benefit of comprehension, because this passage teaches that they should comprehend the aggregates, constituents, sense fields, and the links of dependent origination. “

source: གཏི་མུག་སྤང་བར་འཚལ་བས་ཞེས་བྱ་བ་ལ་སོགས་པ་ཡོངས་སུ་སྤངས་པའི་ཡོན་ཏན་བསྟན་ཏེ། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། ལྟ་བ་དང་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་སྤང་བར་བྱ་ཞེས་འབྱུང་བའི་ཕྱིར་རོ།
en: Who want to eliminate greed, hatred, and confusion” teaches the benefit of elimination because this passage teaches that they should eliminate greed, hatred, and confusion, views, and the ten unwholesome actions.

source: །ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕན་ཡོན་ནི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་མཐར་ཐུག་པའི་བར་རྣམས་ཡོངས་སུ་རྫོགས་པའི་ཚིག་གིས་བསྟན་ཏོ།
en: The benefit of perfecting is the passage teaching that they “complete the ten wholesome actions… the perfections,” and so on, up to “the eighteen distinct attributes of a buddha.”

source: །མངོན་སུམ་དུ་བྱ་བའི་ཕན་ཡོན་ནི་གཟུངས་ཀྱི་སྒོ་དང་ཏིང་ངེ་འཛིན་རྣམས་ཐོབ་པ་ཞེས་བྱ་བའི་ཚིག་གིས་བསྟན་ཏོ།
en: And the benefit of directly witnessing is the passage teaching that they “obtain the dhāraṇi gateways and meditative stabilizations.”

source: །དེ་ནས་ཡང་ཐ་མར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པའི་ཕན་ཡོན་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའི་ཕན་ཡོན་བསྟན་ཏེ།
en: Then it teaches two more benefits: it teaches the benefit that they “fulfill all the intentions of beings” and that they “complete all the wholesome roots.”

source: དེ་གཉིས་ཀྱང་ཡོངས་སུ་རྫོགས་པའི་མཚན་ཉིད་སྔར་སྨོས་པ་དེ་དག་ཉིད་དེ།
en: These two are also just those characteristic of the perfecting spoken about earlier.

source: སྐྱོན་ཆེན་པོའི་སྐབས་དབྱེ་བའི་ཕྱིར་ཐ་མར་བསྟན་ཏོ།
en: They are taught last because they set the scene for the big flaw. “

source: །སྐྱོན་ཆེན་པོ་ཞེས་བྱ་བ་ནི་སྤྱི་བོར་གྱུར་པའམ། གཙོ་བོར་གྱུར་པའི་ཉེས་པའམ། ལྷག་མཐོང་གི་མཚན་ཉིད་སྤྱི་བོར་གྱུར་པའི་གནས་སྐབས་ཀྱི་སྐྱོན་ཡིན་པས་སྐྱོན་ཆེན་པོ་ཞེས་བྱའོ།
en: The big flaw”— this is called “the big flaw” because it is the head or main fault, or because it is the flaw during the peaked period characterized by special insight. “

source: །མཐུན་པའི་ཆོས་ལ་སྲེད་པ་ཞེས་བྱ་བ་ནི་ཕྱིན་ཅི་ལོག་སྤོང་བའི་རྒྱུར་གྱུར་པའི་ཕྱིར་མཐུན་པ་ཞེས་བྱའོ།
en: A conforming love for dharmas”— this is “conforming” because it is in the form of the cause that eliminates error.

source: །ཆོས་སུ་རྣམ་པར་རྟོག་པ་དང་བཅས་པའི་ཕྱིར་ཆོས་ལ་སྲེད་པ་ཞེས་བྱའོ།
en: It is “love for dharmas” because it is together with the mental construction of them as dharmas. “

source: །མངོན་པར་ཞེན་ཅིང་གནས་ཏེ་ཀུན་ཏུ་ཤེས་པའོ་ཞེས་བྱ་བ་ནི་ཆེན་པོར་གྱུར་པའི་གནས་སྐབས་ན་རྣམ་པར་རྟོག་པ་དང་བཅས་པའི་ལྟ་བས་མངོན་པར་ཞེན་པར་བྱེད་དོ། །འབྲིང་གི་གནས་སྐབས་ན་སེམས་ཀྱིས་གནས་པར་བྱེད་དོ། །ཆུང་ངུའི་གནས་སྐབས་ན་འདུ་ཤེས་ཀྱིས་ཀུན་ཏུ་ཤེས་པར་བྱེད་དོ།
en: Form a persistent negative attachment to the notion”— wrong view together with mental construction is “negative attachment” when it is big; the mind is “persistent” when it is middling; and discrimination causes “the notion” when it is small.

source: །ཆོས་རྣམ་པ་གསུམ་ནི་ཕྱིན་ཅི་ལོག་དང་མཐུན་པ་སྟེ། འདུ་ཤེས་ཕྱིན་ཅི་ལོག་དང་། སེམས་ཕྱིན་ཅི་ལོག་དང་། ལྟ་བ་ཕྱིན་ཅི་ལོག་གོ།
en: These three dharmas are in conformity with error: with erroneous discrimination, erroneous mind, and erroneous view.

source: །ཆོས་ལ་སྲེད་པ་ཡང་རྣམ་པ་གཉིས་སུ་བསྟན་ཏེ། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་ལྟ་བའི་ཆོས་ཉིད་དང་། སྒྲུབ་པའི་ཆོས་ཉིད་དོ།
en: It also teaches that there is love for two sorts of dharma: the true dharmic nature of the perfect view of reality, and the true dharmic nature of practice.

source: །སྐྱོན་མེད་པ་ཞེས་བྱ་བའི་སྒྲ་ནི་མེད་པའི་དོན་ཏེ། སྐྱོན་གྱི་དངོས་པོ་ཡོད་པ་མ་ཡིན་པ་ལ་སྐྱོན་མེད་པ་ཞེས་བྱའོ།
en: The locution “flawlessness” connotes an absence, because the thing that is the flaw does not exist, hence “flawlessness.” “

source: །ནང་སྟོང་པ་ཉིད་ལ་ཕྱི་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ལ་ནང་སྟོང་པ་ཉིད་ནི་ནང་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་གི་ཕྱི་སྟོང་པ་ཉིད་ལ་སོགས་པ་སྟོང་པ་ཉིད་གཞན་དག་གིས་སྟོང་པར་བྱས་པ་ནི་མ་ཡིན་ཏེ།
en: Do not see in inner emptiness outer emptiness”— inner emptiness is empty of the intrinsic nature of inner emptiness; it has not been made empty of the other emptinesses, outer emptiness and so on.

source: དེ་བས་ན་ནང་སྟོང་པ་ཉིད་ལ་དེ་སྟོང་པར་བྱ་བའི་ཕྱིར། ཕྱི་སྟོང་པ་ཉིད་མི་ཚོལ་ལོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: So this means that an outer emptiness is not to be sought for in inner emptiness in order to make it empty.

source: །དེ་བཞིན་དུ་ཕྱི་སྟོང་པ་ཉིད་ལ་ཡང་ནང་སྟོང་པ་ཉིད་དོ། །སྟོང་པར་བྱ་བའི་ཕྱིར་མི་ཚོལ་ཏེ། ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་ཡིན་པའི་ཕྱིར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Similarly, “And… in outer emptiness inner emptiness”— this means it is not sought for in order to make it empty, because it is an emptiness of its own intrinsic nature. “

source: །དེ་ལྟར་སློབ་པའི་ཚེ་གཟུགས་ཤེས་པར་བྱ་སྟེ། དེ་ལ་རློམ་སེམས་སུ་ཡང་མི་བྱའོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་མིང་ཙམ་དུ་ཟད་པར་ཤེས་པར་བྱས་ཏེ། མིང་ཙམ་དུ་ཟད་པར་ཤེས་པ་དེས་ཀྱང་ཆོས་རྣམས་ལ་རློམ་སེམས་སུ་མི་བྱ་བའི་ཐ་ཚིག་གོ།
en: Train so that they know form but do not falsely project anything because of it”— this means that they know that all dharmas are empty of their own intrinsic natures and are merely just names, and with the knowledge that they are merely just names they do not falsely project anything.

source: །དེ་ལྟར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་བར་དུ་བསྟན་ནས། དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་ཀྱང་རློམ་སེམས་སུ་མི་བྱའོ་ཞེས་བྱ་བས་བྱང་ཆུབ་ཀྱི་སེམས་ཡོན་ཏན་དང་བཅས་པ་བསྟན་ཏོ།
en: It explains like that up to “the eighteen distinct attributes of a buddha,” and then teaches the thought of awakening together with its good qualities, with bodhisattvas “do not falsely project anything even because of the thought of awakening.” “

source: །འདི་ལྟར་སེམས་དེ་ནི་སེམས་མ་ཡིན་ཏེ་ཞེས་བྱ་བ་ལ་སེམས་ཞེས་བྱ་བའི་སྒྲ་ནི་ཀུན་བརྟགས་པའི་སེམས་ལ་བྱའོ།
en: Because that thought is no thought”— take the word “thought” as imaginary thought.

source: །ཡོངས་སུ་གྲུབ་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སེམས་ཆོས་ཀྱི་སྐུར་གྱུར་པ་ནི། ཡོངས་སུ་རྟོག་པ་དང་རྣམ་པར་རྟོག་པའི་མཚན་ཉིད་ཐམས་ཅད་ལས་འདས་པས་སེམས་ཀྱི་མཚན་ཉིད་མེད་པའི་ཕྱིར་སེམས་མ་ཡིན་པ་ཞེས་བྱའོ།
en: It says it “is no thought” because the thoroughly established—the unsurpassed, perfect, complete awakening thought in the form of the dharma body—transcends everything marked by mental construction and conceptualization, and hence does not have the mark of a thought.

source: །དེ་བས་ན་སེམས་ཀྱི་རང་བཞིན་འོད་གསལ་བ་ཞེས་བྱ་བ་གསུངས་ཏེ། ཆོས་ཀྱི་སྐུའི་སེམས་ཀྱི་རང་བཞིན་ནི་འོད་གསལ་བའོ།
en: Therefore, it says “the basic nature of thought is clear light,” that is, the nature of the thought that is the dharma body is clear light.

source: །དེ་བས་ན་སེམས་མ་ཡིན་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པའི་སེམས་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: So, it “is no thought” means that it is no imaginary thought. “

source: །འདོད་ཆགས་དང་ལྡན་པ་ཡང་མ་ཡིན་བྲལ་བ་ཡང་མ་ཡིན་ཞེས་བྱ་བ་ནི་རང་བཞིན་འོད་གསལ་བ་ཉིད་སྟོན་ཏེ།
en: A thought that is not conjoined with greed nor disjoined from greed” teaches just the basic nature, clear light.

source: སྔོན་སོ་སོའི་སྐྱེ་བོའི་གནས་སྐབས་ན་འདོད་ཆགས་དང་ཞེ་སྡང་ལ་སོགས་པ་སྐྱེ་བའི་དུས་ན་ཡང་ནམ་མཁའ་བཞིན་དུ་དྲི་མ་ཐམས་ཅད་ཀྱིས་མ་གོས་པའི་ཕྱིར་བདེན་པ་ཡང་མ་ཡིན་ཞེས་བྱའོ།
en: Even during the earlier period when greed and hatred and so on arise in an ordinary person, like space, because it is not sullied by any stains, it is “not conjoined.”

source: །ཕྱིས་སངས་རྒྱས་སུ་གྱུར་པའི་ཚེ་ཡང་སེམས་དེ་གློ་བུར་གྱི་ཉོན་མོངས་པ་དང་བྲལ་བས་རང་བཞིན་གྱིས་རྣམ་པར་དག་པ་ཉིད་ལ་གནས་པའི་ཕྱིར་དྲི་མ་དེ་དག་ཤིན་ཏུ་མི་སྐྱེ་བས། སྤྲིན་ལ་སོགས་པ་དེ་དག་དང་མི་ལྡན་པའི་ནམ་མཁའ་བཞིན་དུ་འོད་གསལ་བའི་ཕྱིར་བྲལ་བ་ཡང་མ་ཡིན་ནོ་ཞེས་བྱའོ། །གལ་ཏེ་སྔོན་ལྡན་པར་གྱུར་ན་ནི་ཕྱིས་བྲལ་བར་ཡང་འགྱུར་བ་ཞིག་ན།
en: Later, even when a buddha, because that thought is separated from the afflictive emotions plucked out of thin air and abides in its natural purity, those stains have absolutely not arisen, and so, like space that is not conjoined with clouds and so on, it is clear light and hence “not disjoined” either.
